app/controllers/comments_controller.rb

  def index
    @comments = Comment.all.order('updated_at DESC')
---
SELECT "comments".* FROM "comments" ORDER BY updated_at DESC

    def set_review
      @review = Review.find([:review_id])
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 306], ["LIMIT", 1]]