app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "image", "release_date", "plot", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
SELECT  "movies".* FROM "movies" WHERE "movies"."title" = $1 LIMIT $2  [["title", "GoldenEye"], ["LIMIT", 1]]
---
  def add
    url = Tmdb::Movie.detail(params[:id])

    poster = Tmdb::Movie.posters(params[:id])
    poster.each do |p|
      @poster_url ||= p.file_path
    end
    base_url = 'https://image.tmdb.org/t/p/w342'
    @movie_poster = base_url+@poster_url

    @new_info = { :title => url.title, :release_date => url.release_date, :plot => url.overview, :image => @movie_poster }
    # @movie = Movie.new(@new_info)
    @movie = Movie.find_or_create_by(title: url.title) do |m|