app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (title LIKE '%Psycho%')
SELECT "movies".* FROM "movies" ORDER BY release_date desc
SELECT "reviews".* FROM "reviews" ORDER BY updated_at DESC
---
  def index
    # Check if user is signed in
    if current_user.nil?
      redirect_to '/users/sign_up'
    else
      # Check if user is searching for a title
      @movies = if params[:movie_title]
        # Titleize searched-for title to avoid duplication
        search_params = params[:movie_title].titleize

        # Check if searched-for movie is in database
        query = Movie.where('title LIKE ?', "%#{search_params}%")
        if query.blank?
          @tmdb = true
          url = Tmdb::Search.movie(search_params)
          @URL = url
        else
          query
        end

      # If user not searching, display all movies in database; sorted A->Z
      else
        # Sort all movies depending on user selection
        Movie.order(sort_column + ' ' + sort_direction)
      end

    # Discover all reviews to display; sorted by most recently updated
    @reviews = Review.all.order('updated_at DESC')

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = $1 ORDER BY updated_at DESC  [["movie_id", 37]]
---
  def show
    @movie = Movie.find(params[:id])
    @reviews = @movie.reviews.order('updated_at DESC')

INSERT INTO "movies" ("title", "image", "release_date", "plot", "genre", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
SELECT  "movies".* FROM "movies" WHERE "movies"."title" = $1 LIMIT $2  [["title", "Star Wars: The Last Jedi"], ["LIMIT", 1]]
---
  def new
    # Call TMDB to retrieve movie data
    url = Tmdb::Movie.detail(params[:id])

    # Set the movie poster to the first image in the returned data
    # Consider adding capability to select/change movie poster
    base_url = 'https://image.tmdb.org/t/p/w342'
    poster = Tmdb::Movie.posters(params[:id])
    poster.each do |p|
      @poster_url ||= p.file_path
    end
    @movie_poster = base_url+@poster_url

    # Set the genre to the first instance in the returned data
    new_genre = url.genres
    new_genre.each do |g|
      @first_genre ||= g.name
    end

    # If it doesn't already exist, create new instance of Movie model in the db
    # Used in place of create action
    @movie = Movie.find_or_create_by(title: url.title) do |m|