app/controllers/movie_controller.rb

SELECT "movies".* FROM "movies" ORDER BY title DESC
SELECT "reviews".* FROM "reviews" ORDER BY updated_at DESC
---
  def index
    if current_user.nil?
      redirect_to '/users/sign_up'
    else
      @movies = Movie.search(params[:movie])
      @reviews = Review.all

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def show;
    @movie = Movie.find(params[:id])