app/controllers/review_controller.rb

SELECT "reviews".* FROM "reviews" ORDER BY updated_at DESC
---
  def index
    @reviews = Review.all