app/controllers/reviews_controller.rb

  def index
    @reviews = Review.all.order('updated_at DESC')
---
SELECT "reviews".* FROM "reviews" ORDER BY updated_at DESC

  def new
    @movie = Movie.find(params[:movie_id])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

  def create
    @movie = Movie.find(params[:movie_id])
    @review = Review.new(review_params)
    @review.username = current_user.email
    @review.movie_id = @movie.id
    @review.body = params[:review][:body]
    @review.rating = params[:review][:rating]

    if @review.save
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
INSERT INTO "reviews" ("username", "body", "created_at", "updated_at", "movie_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "test@test.com"], ["body", "body"], ["created_at", "2018-02-07 18:13:04.719832"], ["updated_at", "2018-02-07 18:13:04.719832"], ["movie_id", 11]]